mobilitysoftware/pinoo_boards_arduino/hardware/esp32/1.0.0/boards.txt
##############################################################

pinoo_esp32.name=Pinoo ESP32

pinoo_esp32.bootloader.tool=esp32:esptool_py
pinoo_esp32.bootloader.tool.default=esp32:esptool_py

pinoo_esp32.upload.tool=esp32:esptool_py
pinoo_esp32.upload.tool.default=esp32:esptool_py
pinoo_esp32.upload.tool.network=esp32:esp_ota

pinoo_esp32.upload.maximum_size=1310720
pinoo_esp32.upload.maximum_data_size=327680
pinoo_esp32.upload.flags=
pinoo_esp32.upload.extra_flags=

pinoo_esp32.serial.disableDTR=true
pinoo_esp32.serial.disableRTS=true

pinoo_esp32.build.tarch=xtensa
pinoo_esp32.build.bootloader_addr=0x1000
pinoo_esp32.build.target=esp32
pinoo_esp32.build.mcu=esp32
pinoo_esp32.build.core=esp32:esp32
pinoo_esp32.build.variant=esp32:esp32
pinoo_esp32.build.board=PINOO_ESP32

pinoo_esp32.build.f_cpu=240000000L
pinoo_esp32.build.flash_size=4MB
pinoo_esp32.build.flash_freq=40m
pinoo_esp32.build.flash_mode=dio
pinoo_esp32.build.boot=dio
pinoo_esp32.build.partitions=default
pinoo_esp32.build.defines=
pinoo_esp32.build.loop_core=
pinoo_esp32.build.event_core=

## IDE 2.0 Seems to not update the value
pinoo_esp32.menu.JTAGAdapter.default=Disabled
pinoo_esp32.menu.JTAGAdapter.default.build.copy_jtag_files=0
pinoo_esp32.menu.JTAGAdapter.external=FTDI Adapter
pinoo_esp32.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
pinoo_esp32.menu.JTAGAdapter.external.build.copy_jtag_files=1
pinoo_esp32.menu.JTAGAdapter.bridge=ESP USB Bridge
pinoo_esp32.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
pinoo_esp32.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

pinoo_esp32.menu.PSRAM.disabled=Disabled
pinoo_esp32.menu.PSRAM.disabled.build.defines=
pinoo_esp32.menu.PSRAM.disabled.build.extra_libs=
pinoo_esp32.menu.PSRAM.enabled=Enabled
pinoo_esp32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
pinoo_esp32.menu.PSRAM.enabled.build.extra_libs=

pinoo_esp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
pinoo_esp32.menu.PartitionScheme.default.build.partitions=default
pinoo_esp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
pinoo_esp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
pinoo_esp32.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
pinoo_esp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
pinoo_esp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
pinoo_esp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
pinoo_esp32.menu.PartitionScheme.minimal.build.partitions=minimal
pinoo_esp32.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
pinoo_esp32.menu.PartitionScheme.no_fs.build.partitions=no_fs
pinoo_esp32.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
pinoo_esp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
pinoo_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
pinoo_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pinoo_esp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
pinoo_esp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
pinoo_esp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
pinoo_esp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
pinoo_esp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
pinoo_esp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
pinoo_esp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
pinoo_esp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
pinoo_esp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
pinoo_esp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
pinoo_esp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
pinoo_esp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
pinoo_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
pinoo_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pinoo_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
pinoo_esp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
pinoo_esp32.menu.PartitionScheme.fatflash.build.partitions=ffat
pinoo_esp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
pinoo_esp32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
pinoo_esp32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
pinoo_esp32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
pinoo_esp32.menu.PartitionScheme.rainmaker=RainMaker
pinoo_esp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
pinoo_esp32.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
pinoo_esp32.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
pinoo_esp32.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
pinoo_esp32.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
pinoo_esp32.menu.PartitionScheme.custom=Custom
pinoo_esp32.menu.PartitionScheme.custom.build.partitions=
pinoo_esp32.menu.PartitionScheme.custom.upload.maximum_size=16777216

pinoo_esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
pinoo_esp32.menu.CPUFreq.240.build.f_cpu=240000000L
pinoo_esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
pinoo_esp32.menu.CPUFreq.160.build.f_cpu=160000000L
pinoo_esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
pinoo_esp32.menu.CPUFreq.80.build.f_cpu=80000000L
pinoo_esp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
pinoo_esp32.menu.CPUFreq.40.build.f_cpu=40000000L
pinoo_esp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
pinoo_esp32.menu.CPUFreq.26.build.f_cpu=26000000L
pinoo_esp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
pinoo_esp32.menu.CPUFreq.20.build.f_cpu=20000000L
pinoo_esp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
pinoo_esp32.menu.CPUFreq.13.build.f_cpu=13000000L
pinoo_esp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
pinoo_esp32.menu.CPUFreq.10.build.f_cpu=10000000L

pinoo_esp32.menu.FlashMode.qio=QIO
pinoo_esp32.menu.FlashMode.qio.build.flash_mode=dio
pinoo_esp32.menu.FlashMode.qio.build.boot=qio
pinoo_esp32.menu.FlashMode.dio=DIO
pinoo_esp32.menu.FlashMode.dio.build.flash_mode=dio
pinoo_esp32.menu.FlashMode.dio.build.boot=dio

pinoo_esp32.menu.FlashFreq.80=80MHz
pinoo_esp32.menu.FlashFreq.80.build.flash_freq=80m
pinoo_esp32.menu.FlashFreq.40=40MHz
pinoo_esp32.menu.FlashFreq.40.build.flash_freq=40m

pinoo_esp32.menu.FlashSize.4M=4MB (32Mb)
pinoo_esp32.menu.FlashSize.4M.build.flash_size=4MB
pinoo_esp32.menu.FlashSize.8M=8MB (64Mb)
pinoo_esp32.menu.FlashSize.8M.build.flash_size=8MB
pinoo_esp32.menu.FlashSize.8M.build.partitions=default_8MB
pinoo_esp32.menu.FlashSize.2M=2MB (16Mb)
pinoo_esp32.menu.FlashSize.2M.build.flash_size=2MB
pinoo_esp32.menu.FlashSize.2M.build.partitions=minimal
pinoo_esp32.menu.FlashSize.16M=16MB (128Mb)
pinoo_esp32.menu.FlashSize.16M.build.flash_size=16MB

pinoo_esp32.menu.UploadSpeed.921600=921600
pinoo_esp32.menu.UploadSpeed.921600.upload.speed=921600
pinoo_esp32.menu.UploadSpeed.115200=115200
pinoo_esp32.menu.UploadSpeed.115200.upload.speed=115200
pinoo_esp32.menu.UploadSpeed.256000.windows=256000
pinoo_esp32.menu.UploadSpeed.256000.upload.speed=256000
pinoo_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
pinoo_esp32.menu.UploadSpeed.230400=230400
pinoo_esp32.menu.UploadSpeed.230400.upload.speed=230400
pinoo_esp32.menu.UploadSpeed.460800.linux=460800
pinoo_esp32.menu.UploadSpeed.460800.macosx=460800
pinoo_esp32.menu.UploadSpeed.460800.upload.speed=460800
pinoo_esp32.menu.UploadSpeed.512000.windows=512000
pinoo_esp32.menu.UploadSpeed.512000.upload.speed=512000

pinoo_esp32.menu.LoopCore.1=Core 1
pinoo_esp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
pinoo_esp32.menu.LoopCore.0=Core 0
pinoo_esp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

pinoo_esp32.menu.EventsCore.1=Core 1
pinoo_esp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
pinoo_esp32.menu.EventsCore.0=Core 0
pinoo_esp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

pinoo_esp32.menu.DebugLevel.none=None
pinoo_esp32.menu.DebugLevel.none.build.code_debug=0
pinoo_esp32.menu.DebugLevel.error=Error
pinoo_esp32.menu.DebugLevel.error.build.code_debug=1
pinoo_esp32.menu.DebugLevel.warn=Warn
pinoo_esp32.menu.DebugLevel.warn.build.code_debug=2
pinoo_esp32.menu.DebugLevel.info=Info
pinoo_esp32.menu.DebugLevel.info.build.code_debug=3
pinoo_esp32.menu.DebugLevel.debug=Debug
pinoo_esp32.menu.DebugLevel.debug.build.code_debug=4
pinoo_esp32.menu.DebugLevel.verbose=Verbose
pinoo_esp32.menu.DebugLevel.verbose.build.code_debug=5

pinoo_esp32.menu.EraseFlash.none=Disabled
pinoo_esp32.menu.EraseFlash.none.upload.erase_cmd=
pinoo_esp32.menu.EraseFlash.all=Enabled
pinoo_esp32.menu.EraseFlash.all.upload.erase_cmd=-e

pinoo_esp32.menu.ZigbeeMode.default=Disabled
pinoo_esp32.menu.ZigbeeMode.default.build.zigbee_mode=
pinoo_esp32.menu.ZigbeeMode.default.build.zigbee_libs=
pinoo_esp32.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
pinoo_esp32.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
pinoo_esp32.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################
